I have the same issue with different availability zones. 
In my terraform code I have:
```terraform
locals {
  cluster_azs = [
    "us-east-1a",
    "us-east-1b"
  ]
}
```

After the cluster creation, running a `terraform plan` always comes out as:

```
  # aws_rds_cluster.backend must be replaced
-/+ resource "aws_rds_cluster" "backend" {
      ~ allocated_storage                   = 1 -> (known after apply)
      + apply_immediately                   = (known after apply)
      ~ arn                                 = "arn:aws:rds:us-east-1:<account-id>:cluster:<cluster_name>" -> (known after apply)
      ~ availability_zones                  = [ # forces replacement
          - "us-east-1c",
            # (2 unchanged elements hidden)
```

